app/views/messages/index.html.haml

SELECT `group_users`.`id` FROM `group_users` WHERE `group_users`.`user_id` = 1
---
      MEMBER:
      = current_user.group_users.ids
  .chat-main__body