app/controllers/users_controller.rb

UPDATE `users` SET `name` = 'MoritaKyuma', `updated_at` = '2018-10-19 11:36:55' WHERE `users`.`id` = 1
---
  def update
    if current_user.update(user_params)