app/views/layouts/_side_bar.html.haml

    .chat-side__groups-list
      - current_user.groups.each do |group|
---
SELECT `groups`.* FROM `groups` INNER JOIN `group_users` ON `groups`.`id` = `group_users`.`group_id` WHERE `group_users`.`user_id` = 1